app/Http/Services/Menu/MenuService.php

    public function getParent()
    {
        return Menu::where('parent_id', 0)->get();
---
select * from `menus` where `parent_id` = 0

    public function show()
    {
        return Menu::select('name', 'id')
            ->where('parent_id', 0)
            ->orderbyDesc('id')
            ->get();
---
select `name`, `id` from `menus` where `parent_id` = 0 order by `id` desc

    public function getAll()
    {
        return Menu::orderbyDesc('id')->paginate(20);
---
select * from `menus` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `menus`

    public function getId($id)
    {
        return Menu::where('id', $id)->where('active', 1)->firstOrFail();
---
select * from `menus` where `id` = '2' and `active` = 1 limit 1

    public function getProduct($menu, $request)
    {
        $query = $menu->products()
            ->select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1);

        if ($request->input('price')) {
            $query->orderBy('price', $request->input('price'));
        }

        return $query
            ->orderByDesc('id')
            ->paginate(12)
            ->withQueryString();
---
select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `products`.`menu_id` = 2 and `products`.`menu_id` is not null and `active` = 1 order by `id` desc limit 12 offset 0
select count(*) as aggregate from `products` where `products`.`menu_id` = 2 and `products`.`menu_id` is not null and `active` = 1