app/Http/Services/Product/ProductService.php

    public function get($page = null)
    {
        return Product::select('id', 'name', 'quantity', 'price', 'price_sale', 'thumb')
            ->orderByDesc('id')
            ->when($page != null, function ($query) use ($page) {
                $query->offset($page * self::LIMIT);
            })
            ->limit(self::LIMIT)
            ->get();
---
select `id`, `name`, `price`, `price_sale`, `thumb` from `products` order by `id` desc limit 16 offset 16