app/Http/Services/Product/ProductAdminService.php

    public function getMenu()
    {
        return Menu::where('active', 1)->get();
---
select * from `menus` where `active` = 1