app/Http/Controllers/Admin/Users/ForgotPasswordController.php

update `users` set `password` = '$2y$10$AwtS6/70GwK33awTUaRkB.vhqKsGLwiIzVfcLYk7S/.b7Ks3yyemy', `users`.`updated_at` = '2024-11-30 11:23:11' where `id` = 3
---
            function ($user, $password) {
                $user->forceFill([
                    'password' => Hash::make($password),
                ])->save();